[
   {
      "id":1,
      "category":1,
      "postDate":"2023-05-14",
      "featureImage": "https://images.unsplash.com/photo-1629335493489-401158ef29e2?w=200&h=200&auto=format&fit=crop&q=60",
      "price":9.99,
      "title":"Lawnmower",
      "body":"This high-quality lawnmower is perfect for maintaining a neat and healthy lawn. With its durable blades and ergonomic handle, it makes mowing the lawn a breeze. It also features an easy-start engine and adjustable height settings to suit different grass lengths.",
      "published":true
   },
   {
      "id":2,
      "category":1,
      "postDate":"2023-05-15",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":19.99,
      "title":"Weber BBQ",
      "body":"The Weber BBQ offers unmatched performance and is built for easy grilling. Whether you're hosting a family gathering or a neighborhood barbecue, this grill ensures even cooking and high heat retention for the perfect cookout experience.",
      "published":true
   },
   {
      "id":3,
      "category":2,
      "postDate":"2023-05-16",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":439.99,
      "title":"PS5",
      "body":"The PlayStation 5 delivers immersive gaming with lightning-fast load times and stunning graphics. Play exclusive titles with breathtaking visuals and smooth gameplay. Enjoy the next generation of gaming with the PS5 console, a must-have for avid gamers.",
      "published":true
   },
   {
      "id":4,
      "category":2,
      "postDate":"2023-05-17",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":459.99,
      "title":"XBOX",
      "body":"Experience the future of gaming with the Xbox Series X. With 4K resolution and a powerful processor, this console ensures smooth and responsive gameplay. Enjoy your favorite titles and new releases in high definition with unmatched performance.",
      "published":true
   },
   {
      "id":5,
      "category":3,
      "postDate":"2023-05-18",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":39.99,
      "title":"TShirt",
      "body":"This comfortable cotton T-shirt is a perfect addition to any wardrobe. Soft to the touch and available in various colors, it offers breathability and durability. Great for everyday wear, it pairs well with jeans or shorts for a casual look.",
      "published":true
   },
   {
      "id":6,
      "category":3,
      "postDate":"2023-05-19",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":29.99,
      "title":"Shorts",
      "body":"These stylish and comfortable shorts are ideal for warm weather. Made from soft fabric, they are perfect for outdoor activities, lounging, or casual outings. With an adjustable waistband and multiple sizes, they offer both comfort and flexibility.",
      "published":true
   },
   {
      "id":7,
      "category":4,
      "postDate":"2023-05-20",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":19.99,
      "title":"Baseball",
      "body":"This high-quality baseball is designed for recreational play or competitive matches. Made from durable leather and stitched with precision, it ensures lasting performance and excellent grip. Perfect for practice or game day.",
      "published":true
   },
   {
      "id":8,
      "category":4,
      "postDate":"2023-05-21",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":99.99,
      "title":"Soccer Ball",
      "body":"This premium soccer ball offers excellent bounce and durability for both practice and games. Made with a reinforced outer shell, it provides a perfect grip and optimal control on the field. Ideal for players of all skill levels.",
      "published":true
   },
   {
      "id":9,
      "category":5,
      "postDate":"2023-05-16",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":99.99,
      "title":"Dog Food",
      "body":"Nutrient-rich dog food made with high-quality ingredients to support your dog's health and well-being. Packed with essential proteins, vitamins, and minerals, it ensures your pet stays active and healthy. Available in various flavors to suit your dog's preferences.",
      "published":true
   },
   {
      "id":10,
      "category":5,
      "postDate":"2023-05-16",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":9.99,
      "title":"Fish Food",
      "body":"This fish food is formulated to provide a balanced diet for your aquarium fish. It promotes vibrant colors, healthy growth, and strong immune systems. Suitable for a variety of fish species, it is easy to digest and ensures clean water.",
      "published":true
   },
   {
      "id":11,
      "category":1,
      "postDate":"2023-06-01",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":49.99,
      "title":"Trimmer",
      "body":"This electric trimmer is perfect for grooming your lawn edges with precision. The lightweight design and sharp blade make trimming tasks quick and easy. Ideal for smaller areas or detail work.",
      "published":true
   },
   {
      "id":12,
      "category":2,
      "postDate":"2023-06-02",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":349.99,
      "title":"Nintendo Switch",
      "body":"The Nintendo Switch offers hybrid gameplay that can be enjoyed at home or on the go. With exclusive games and versatile controls, it’s perfect for solo gaming or multiplayer fun. A console for all ages and all playstyles.",
      "published":true
   },
   {
      "id":13,
      "category":3,
      "postDate":"2023-06-03",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":24.99,
      "title":"Sweatshirt",
      "body":"This cozy sweatshirt is made from soft cotton and polyester fabric, offering warmth and comfort. Perfect for chilly evenings or casual outings, it’s available in various colors and sizes for every occasion.",
      "published":true
   },
   {
      "id":14,
      "category":4,
      "postDate":"2023-06-04",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":14.99,
      "title":"Football",
      "body":"This durable football is perfect for games with friends or team practice. Made from synthetic leather, it features excellent grip and control, ensuring accuracy and consistency in every pass or throw.",
      "published":true
   },
   {
      "id":15,
      "category":5,
      "postDate":"2023-06-05",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":18.99,
      "title":"Cat Food",
      "body":"Premium cat food with high-quality protein to keep your feline friend strong and healthy. This food is designed for all life stages, providing essential nutrients to support your cat’s immune system, coat, and overall vitality.",
      "published":true
   },
   {
      "id":16,
      "category":1,
      "postDate":"2023-06-06",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":59.99,
      "title":"Hedge Trimmer",
      "body":"Keep your garden neat with this powerful hedge trimmer. Featuring adjustable length and sharp blades, it easily tackles overgrown hedges and bushes, leaving your outdoor spaces looking pristine.",
      "published":true
   },
   {
      "id":17,
      "category":2,
      "postDate":"2023-06-07",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":499.99,
      "title":"VR Headset",
      "body":"Experience the future of entertainment with this high-quality VR headset. Offering immersive visuals and intuitive controls, it lets you explore virtual worlds in stunning detail. Perfect for gaming, movies, and VR experiences.",
      "published":true
   },
   {
      "id":18,
      "category":3,
      "postDate":"2023-06-08",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":14.99,
      "title":"Socks",
      "body":"Soft and comfortable socks that provide warmth and breathability. Made with high-quality materials, they offer a perfect fit for everyday wear and come in a variety of colors and patterns.",
      "published":true
   },
   {
      "id":19,
      "category":4,
      "postDate":"2023-06-09",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":39.99,
      "title":"Tennis Racket",
      "body":"This high-performance tennis racket is ideal for beginners and experienced players alike. With a lightweight frame and a comfortable grip, it delivers excellent control and power on the court.",
      "published":true
   },
   {
      "id":20,
      "category":5,
      "postDate":"2023-06-10",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":16.99,
      "title":"Bird Food",
      "body":"This premium bird food is designed to attract a variety of wild birds to your garden. Packed with nutrients and flavors that birds love, it supports their health and encourages frequent visits.",
      "published":true
   },
   {
      "id":21,
      "category":1,
      "postDate":"2023-06-11",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":49.99,
      "title":"Pressure Washer",
      "body":"This powerful pressure washer is perfect for cleaning driveways, patios, and vehicles. With adjustable pressure settings, it tackles tough dirt and grime, leaving surfaces spotless in no time.",
      "published":true
   },
   {
      "id":22,
      "category":2,
      "postDate":"2023-06-12",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":149.99,
      "title":"Gaming Headset",
      "body":"Get fully immersed in your gaming experience with this high-quality gaming headset. Featuring surround sound and noise cancellation, it provides crystal-clear audio and comfortable wear for extended gaming sessions.",
      "published":true
   },
   {
      "id":23,
      "category":3,
      "postDate":"2023-06-13",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":34.99,
      "title":"Jogging Pants",
      "body":"These jogging pants are designed for comfort and flexibility. Made from soft fabric, they are perfect for workouts or casual outings. With an adjustable waistband and a sleek fit, they are a great addition to your activewear collection.",
      "published":true
   },
   {
      "id":24,
      "category":4,
      "postDate":"2023-06-14",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":24.99,
      "title":"Golf Club",
      "body":"This high-performance golf club is perfect for both beginners and experienced players. With a comfortable grip and balanced weight, it provides excellent control and power for your golf game.",
      "published":true
   },
   {
      "id":25,
      "category":5,
      "postDate":"2023-06-15",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":12.99,
      "title":"Hamster Food",
      "body":"This nutritious hamster food is designed to support the health and vitality of your small pet. Packed with essential vitamins, minerals, and fiber, it ensures a balanced diet for your hamster's growth and well-being.",
      "published":true
   },
   {
      "id":26,
      "category":1,
      "postDate":"2023-06-16",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":69.99,
      "title":"Power Drill",
      "body":"This power drill is perfect for home improvement projects. With multiple speed settings and an ergonomic design, it makes drilling holes in wood, metal, and other materials quick and easy.",
      "published":true
   },
   {
      "id":27,
      "category":2,
      "postDate":"2023-06-17",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":299.99,
      "title":"Smartphone",
      "body":"This smartphone combines cutting-edge technology with sleek design. Featuring a high-resolution camera, fast processor, and long-lasting battery, it keeps you connected and entertained all day long.",
      "published":true
   },
   {
      "id":28,
      "category":3,
      "postDate":"2023-06-18",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":39.99,
      "title":"Jacket",
      "body":"This stylish jacket offers warmth and protection from the elements. Made from durable fabric, it is perfect for chilly evenings or windy days. With multiple pockets and a sleek design, it’s both functional and fashionable.",
      "published":true
   },
   {
      "id":29,
      "category":4,
      "postDate":"2023-06-19",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":64.99,
      "title":"Skateboard",
      "body":"This durable skateboard is ideal for beginners and experienced riders alike. With a sturdy deck and smooth wheels, it provides excellent control and stability. Perfect for cruising around the neighborhood or performing tricks.",
      "published":true
   },
   {
      "id":30,
      "category":5,
      "postDate":"2023-06-20",
      "featureImage":"https://dummyimage.com/200x200/000/fff",
      "price":29.99,
      "title":"Rabbit Food",
      "body":"This nutritious rabbit food is packed with essential vitamins and minerals to support your pet’s health. It contains fiber to aid digestion and a balanced mix of ingredients to keep your rabbit healthy and active.",
      "published":true
   }
]
